---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterWarning
source: html/9d841342-d2de-be3b-f034-3a5d986b8f37.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.LengthParameterWarning Property

This is used to post warning. The "Total Length" parameter must be set to a strictly positive value.

## Syntax (C#)
```csharp
public static FailureDefinitionId LengthParameterWarning { get; }
```